IDEA StatiCa Open Model
PolyLine2D.StartPoint Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the point where the PolyLine2D begins.
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Point2D StartPoint { get; set; }
Public Property StartPoint As Point2D
	Get
	Set
public:
property Point2D^ StartPoint {
	Point2D^ get ();
	void set (Point2D^ value);
}
Property Value
Type: Point2D
See Also
Reference
PolyLine2D Class
IdeaRS.OpenModel.Geometry2D Namespace